XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.AC30M1x64_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>AC30M1x64_Series</name>
  <description>ABOV Semiconductor Motor Solution Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.01.0" date="2021-01-11">
            First Release version of ABOV Motor Solution Device Family Pack.
			- AC30M1x64_Series device : AC30M1464, AC30M1364, AC30M1432, AC30M1332
    </release>
  </releases>
  <keywords>
    <keyword>ABOV</keyword>
    <keyword>MOTOR</keyword>
    <keyword>AC30M1x64</keyword>
    <keyword>AC30M1464</keyword>
    <keyword>AC30M1364</keyword>
    <keyword>AC30M1432</keyword>
    <keyword>AC30M1332</keyword>
  </keywords>
  <devices>
   <family Dfamily="AC30M1x64 Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV AC30M1x64 device family contains an ARM Cortex-M0 processor with a versatile set of on-chip peripherals</description>
      <!-- Subfamily : AC30M1x64 *********************************************************-->
      <subFamily DsubFamily="AC30M1x64">
        <processor Dclock="40000000" />
        <compile header="AC30M1x64\Core\include\AC30M1x64.h" />
        <debug svd="AC30M1x64\Svd\AC30M1x64.svd" />
	<algorithm name="AC30M1x64\Flashloader\AC30M1x64_64.FLM" start="0x00000000" size="0x10000" default="1" />
        <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        <memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1" />
        <feature type="Temp" n="-40" m="105" />
        <feature type="WDT" n="1" m="32" name="Watchdog Timer" />
        <feature type="Timer" n="4" m="16" name="Timer" />
        <feature type="UART" n="2" name="UART" />
        <feature type="SPI" n="1" name="SPI" />
        <feature type="I2C" n="1" name="I2C" />
        <feature type="PWM" n="1" m="16" name="PWM" />
        <feature type="Other" n="1" m="32" name="FRT" />
        <!-- Device : AC30M1464 -->
        <device Dname="AC30M1464">
          <description>Package type 48LQFP</description>
            <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
          <memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1" />
          <feature type="IOs" n="44" name="Inputs/Outputs" />
          <feature type="ADC" n="1" m="12" name="ADC" />
          <feature type="QFP" n="48" name="LQFP" />
        </device>
	    <!-- Device : AC30M1364 -->
        <device Dname="AC30M1364">
          <description>Package type 32LQFP, 32QFN</description>
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
          <memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1" />
          <feature type="IOs" n="28" name="Inputs/Outputs" />
          <feature type="ADC" n="1" m="8" name="ADC" />
          <feature type="QFP" n="32" name="LQFP" />
          <feature type="QFN" n="32" name="QFN" />
        </device>
      </subFamily>
    </family>

  </devices>
  <conditions>
     <!-- condition : AC30M1464/1364/1432/1332 ********************************************************-->
    <condition id="AC30M1x64 CMSIS">
      <description>AC30M1464/1364/1432/1332 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="AC30M1464" />
	  <accept Dvendor="ABOV Semiconductor:126" Dname="AC30M1364" />
    </condition>
  </conditions>
  <components>
    <!-- component : AC30M1464/1364/1432/1332 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>System Startup for ABOV AC30M1464/1364/1432/1332 devices</description>
      <files>
        <file category="include" name="AC30M1x64\Core\include\" />
        <file category="include" name="AC30M1x64\Drivers\include\" />
        <file category="header" version="1.0.0" name="AC30M1x64\Core\include\AC30M1x64.h" attr="config" />
        <file category="source" version="1.0.0" name="AC30M1x64\Core\source\ARM\startup_AC30M1x64.s" attr="config" />
        <file category="source" version="1.0.0" name="AC30M1x64\Core\source\system_AC30M1x64.c" attr="config" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="DEBUG_FRAMEWORK" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 debug framework</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\slib.h" />
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_debug_frmwrk.h" />
        <file category="source" name="AC30M1x64\Drivers\source\slib.c" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 ADC control</description>
      <files>
        <file category="header" name="AC30M1x64/Drivers\include\AC30M1x64_hal_adc.h" />
        <file category="source" name="AC30M1x64/Drivers\source\AC30M1x64_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FRT" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 FRT control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_frt.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_frt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 GPIO control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_pcu.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_pcu.c" />
      </files>
    </component>
