XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.AC30M1x64_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 I2C control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_i2c.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="MPWM" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 MPWM control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_mpwm.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_mpwm.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 Power control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_pwr.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 SCU control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_scu.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 SPI control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_spi.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Timer" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 Timer control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_timer.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_timer.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 UART control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_uart.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_uart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="AC30M1x64 CMSIS">
      <description>AC30M1x64 WDT control</description>
      <files>
        <file category="header" name="AC30M1x64\Drivers\include\AC30M1x64_hal_wdt.h" />
        <file category="source" name="AC30M1x64\Drivers\source\AC30M1x64_hal_wdt.c" />
      </files>
    </component>
  </components>
  <boards>
    <!-- board : AC30M1464 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-AC30M1464LBN" revision="V1.1">
      <description>StarterKit-AC30M1464LBN</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="AC30M1464" />
	  <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="AC30M1364" />
      <feature type="XTAL" n="16000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs : D101~D106" />
	  <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
  <!-- example : AC30M1464/1364/1432/1332 **********************************************************-->
    <example name="ABOV ADC burst" doc="Abstract.txt" folder="AC30M1x64\Examples\ADC\Adc_Burst">
      <description>ADC burst example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Burst.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC interrupt" doc="Abstract.txt" folder="AC30M1x64\Examples\ADC\Adc_Interrupt">
      <description>ADC interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC polling" doc="Abstract.txt" folder="AC30M1x64/Examples/ADC/Adc_Polling">
      <description>ADC polling example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC sequence" doc="Abstract.txt" folder="AC30M1x64/Examples/ADC/Adc_Seq">
      <description>ADC sequence example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Seq.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Clock Change" doc="Abstract.txt" folder="AC30M1x64/Examples/ClkChange/ClkChange_test">
      <description>Clock Change example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ClkChange_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DIV" doc="Abstract.txt" folder="AC30M1x64/Examples/DIV64/DIV64_test">
      <description>Privilege example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DIV64_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Flash memory control" doc="Abstract.txt" folder="AC30M1x64/Examples/FMC/FMC_WriteErase">
      <description>Flash memory write/erase example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Flash memory 32k control" doc="Abstract.txt" folder="AC30M1x64/Examples/FMC/FMC_WriteErase_32ksize">
      <description>Flash memory write/erase 32k example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase_32ksize.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Flash memory sub control" doc="Abstract.txt" folder="AC30M1x64/Examples/FMC/FMC_WriteErase_sub">
      <description>Flash memory write/erase sub example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase_sub.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FRT" doc="Abstract.txt" folder="AC30M1x64/Examples/FRT/Frt_test">
      <description>Free Run Timer example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Frt_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Ext. INT." doc="Abstract.txt" folder="AC30M1x64/Examples/GPIO/Gpio_ExtInt">
      <description>GPIO external interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_ExtInt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO input" doc="Abstract.txt" folder="AC30M1x64/Examples/GPIO/Gpio_Input">
      <description>GPIO input example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED blinky" doc="Abstract.txt" folder="AC30M1x64/Examples/GPIO/Gpio_LedBlinky">
      <description>GPIO LED blinky example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C" doc="Abstract.txt" folder="AC30M1x64/Examples/I2C/I2c_MasterSlave">
      <description>I2C example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2c_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV MPWM" doc="Abstract.txt" folder="AC30M1x64/Examples/MPWM/Mpwm_Test">
      <description>MPWM example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Mpwm_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVD" doc="Abstract.txt" folder="AC30M1x64/Examples/PWR/LVD">
      <description>Low Voltage detector (LVD) example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LVD.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Power down mode" doc="Abstract.txt" folder="AC30M1x64/Examples/PWR/Pwr_PowerDown">
      <description>Power down mode example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Pwr_PowerDown.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV sleep mode" doc="Abstract.txt" folder="AC30M1x64/Examples/PWR/Pwr_Sleep">
      <description>Sleep mode example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Pwr_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Master Interrupt" doc="Abstract.txt" folder="AC30M1x64/Examples/SPI/SPI_Master_Interrupt">
      <description>SPI Master Interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Master_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Master Polling" doc="Abstract.txt" folder="AC30M1x64/Examples/SPI/SPI_Master_Polling">
      <description>SPI Master Polling example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Master_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Slave Interrupt" doc="Abstract.txt" folder="AC30M1x64/Examples/SPI/SPI_Slave_Interrupt">
      <description>SPI Slave Interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Slave_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Slave Polling" doc="Abstract.txt" folder="AC30M1x64/Examples/SPI/SPI_Slave_Polling">
      <description>SPI Slave Polling example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Slave_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="AC30M1x64/Examples/StarterKit/Gpio_LedBlinky">
      <description>Starter Kit - Gpio_LedBlinky (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\StartKit_Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer capture" doc="Abstract.txt" folder="AC30M1x64/Examples/TIMER/Timer_Capture">
      <description>Timer capture example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer INT." doc="Abstract.txt" folder="AC30M1x64/Examples/TIMER/Timer_MatchInterrupt">
      <description>Timer interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer polling" doc="Abstract.txt" folder="AC30M1x64/Examples/TIMER/Timer_MatchPolling">
      <description>Timer polling example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer one shot" doc="Abstract.txt" folder="AC30M1x64/Examples/TIMER/Timer_OneShot">
      <description>Timer one shot example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer PWM" doc="Abstract.txt" folder="AC30M1x64/Examples/TIMER/Timer_PWM">
      <description>Timer PWM example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART INT." doc="Abstract.txt" folder="AC30M1x64/Examples/UART/Uart_Interrupt">
      <description>UART interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART polling" doc="Abstract.txt" folder="AC30M1x64/Examples/UART/Uart_Polling">
      <description>UART polling example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT INT." doc="Abstract.txt" folder="AC30M1x64/Examples/WDT/Wdt_Interrupt">
      <description>WDT interrupt example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT reset" doc="Abstract.txt" folder="AC30M1x64/Examples/WDT/Wdt_Reset">
      <description>WDT reset example (AC30M1464/1364)</description>
      <board name="StarterKit-AC30M1464LBN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>